app/views/taskks/index.html.erb

SELECT "taskks".* FROM "taskks" ORDER BY "taskks"."created_at" DESC
---
<p>List of Tasks in the particular order</p>
<p> Not Done Count: <%=Taskk.not_done_tasks(@tasks).count%></p>