app/controllers/task_lists_controller.rb

   def create
      @task_list = TaskList.new(task_list_params)
      if @task_list.save
---
INSERT INTO "task_lists" ("expense", "allocated_to", "task_list_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["expense", 100], ["allocated_to", "Rohit Katkar"], ["task_list_date", "2018-09-24 00:00:00"], ["created_at", "2018-09-24 09:27:51.549163"], ["updated_at", "2018-09-24 09:27:51.549163"]]

  def show
    @list =TaskList.find(params[:id])
    @list.taskks.each do |x|
---
SELECT  "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "taskks".* FROM "taskks" WHERE "taskks"."id" = $1 LIMIT $2  [["id", 132], ["LIMIT", 1]]

  def destroy
      @task_list = TaskList.find(params[:id])
      @task_list.destroy
---
SELECT  "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "task_lists" WHERE "task_lists"."id" = $1  [["id", 1]]

  def edit
    @list =TaskList.find(params[:id])

    @list.taskks.each do |x|
---
SELECT  "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "taskks".* FROM "taskks" WHERE "taskks"."id" = $1 LIMIT $2  [["id", 112], ["LIMIT", 1]]

  def update
    @task_list =TaskList.find(params[:id])
    @task_list.update_attributes(task_list_params)
---
SELECT  "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "task_lists" SET "allocated_to" = $1, "updated_at" = $2 WHERE "task_lists"."id" = $3  [["allocated_to", "Jitesh Bagul"], ["updated_at", "2018-09-19 13:26:44.135628"], ["id", 7]]

  def index
  	@task_lists = TaskList.all.order(created_at: :desc)
---
SELECT "task_lists".* FROM "task_lists" ORDER BY "task_lists"."created_at" DESC