app/controllers/taskks_controller.rb

  def show
    @taskk =Taskk.find(params[:id])
---
SELECT  "taskks".* FROM "taskks" WHERE "taskks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def edit
    @taskk = Taskk.find(params[:id])
---
SELECT  "taskks".* FROM "taskks" WHERE "taskks"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]

  def index
  	@tasks = Taskk.all
---
SELECT "taskks".* FROM "taskks" ORDER BY "taskks"."created_at" DESC