app/controllers/task_lists_controller.rb

SELECT "task_lists".* FROM "task_lists"
---
  def index
  	@task_lists = TaskList.all