app/views/task_lists/index.html.erb


  <% TaskList.all.each do |task_list| %>
---
SELECT "task_lists".* FROM "task_lists" ORDER BY "task_lists"."created_at" DESC