app/views/task_lists/show.html.erb

SELECT "taskks".* FROM "taskks" WHERE "taskks"."task_list_id" = $1  [["task_list_id", 6]]
SELECT COUNT(*) FROM "taskks" WHERE "taskks"."task_list_id" = $1  [["task_list_id", 6]]
---

<p> Tasks Count: <%= @task_list.taskks.count %> </p>